Задание 1
имеется текстовый файл f.csv, по формату похожий на .csv с разделителем |
"""
lastname|name|patronymic|date_of_birth|id
Фамилия1|Имя1|Отчество1 |21.11.1998   |312040348-3048
Фамилия2|Имя2|Отчество2 |11.01.1972   |457865234-3431
...
"""
1. Реализовать сбор уникальных записей
2. Случается, что под одинаковым id присутствуют разные данные - собрать такие записи

In [1]:
import pandas as pd

In [75]:
f = {'lastname': ['Фамилия1', 'Фамилия2', 'Фамилия3', 'Фамилия6', 'Фамилия1'],
     'name': ['Имя1', 'Имя2', 'Имя3', 'Имя6', 'Имя1'],
     'patronymic': ['Отчество1', 'Отчество2', 'Отчество3', 'Отчество6', 'Отчество1'],
     'date_of_birth': ['21.11.1998', '11.01.1972', '22.03.2000', '13.06.1998', '21.11.1998'],
     'id': ['312040348-3048', '457865234-3431', '3852958693-5835', '312040348-3048', '312040348-3048']}

df = pd.DataFrame(f)
df.to_csv("f.csv", sep='|', encoding='utf-8-sig')

In [76]:
df = pd.read_csv('f.csv', sep='|')
df = df.drop(columns=['Unnamed: 0'])
df

   lastname  name patronymic date_of_birth               id
0  Фамилия1  Имя1  Отчество1    21.11.1998   312040348-3048
1  Фамилия2  Имя2  Отчество2    11.01.1972   457865234-3431
2  Фамилия3  Имя3  Отчество3    22.03.2000  3852958693-5835
3  Фамилия6  Имя6  Отчество6    13.06.1998   312040348-3048
4  Фамилия1  Имя1  Отчество1    21.11.1998   312040348-3048

In [77]:
# оставим только уникальные значения
unique = df.drop_duplicates()
unique

   lastname  name patronymic date_of_birth               id
0  Фамилия1  Имя1  Отчество1    21.11.1998   312040348-3048
1  Фамилия2  Имя2  Отчество2    11.01.1972   457865234-3431
2  Фамилия3  Имя3  Отчество3    22.03.2000  3852958693-5835
3  Фамилия6  Имя6  Отчество6    13.06.1998   312040348-3048

In [78]:
# соберем разные данные под одинаковым id
same_id_first = df[df.duplicated(['id'])].drop_duplicates()

# способ через groupby и filter
same_id_second = df.groupby('id').filter(lambda x: len(x) > 1).drop_duplicates(keep="first")

same_id_first

   lastname  name patronymic date_of_birth              id
3  Фамилия6  Имя6  Отчество6    13.06.1998  312040348-3048
4  Фамилия1  Имя1  Отчество1    21.11.1998  312040348-3048

In [79]:
same_id_second

   lastname  name patronymic date_of_birth              id
0  Фамилия1  Имя1  Отчество1    21.11.1998  312040348-3048
3  Фамилия6  Имя6  Отчество6    13.06.1998  312040348-3048